---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalService.MultiServerService
source: html/a1476acb-1ff1-d11c-6070-d88435bf4174.htm
---
# MultiServerService Members

Registers a server with its service.